{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "bos_token_id": null,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "eos_token_id": null,
  "hidden_dim": 3072,
  "id2label": {
    "0": "Amity School of Applied Sciences",
    "1": "Amity School of Architecture & Planning",
    "2": "Amity School of Biotechnology",
    "3": "Amity School of Business",
    "4": "Amity School of Communication",
    "5": "Amity School of Computer Science",
    "6": "Amity School of Design",
    "7": "Amity School of Engineering & Technology",
    "8": "Amity School of Fine Arts",
    "9": "Amity School of Hospitality",
    "10": "Amity School of Law",
    "11": "Amity School of Liberal Arts"
  },
  "initializer_range": 0.02,
  "label2id": {
    "Amity School of Applied Sciences": 0,
    "Amity School of Architecture & Planning": 1,
    "Amity School of Biotechnology": 2,
    "Amity School of Business": 3,
    "Amity School of Communication": 4,
    "Amity School of Computer Science": 5,
    "Amity School of Design": 6,
    "Amity School of Engineering & Technology": 7,
    "Amity School of Fine Arts": 8,
    "Amity School of Hospitality": 9,
    "Amity School of Law": 10,
    "Amity School of Liberal Arts": 11
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "tie_word_embeddings": true,
  "transformers_version": "5.2.0",
  "use_cache": false,
  "vocab_size": 30522
}
